---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.IsDone
source: html/37dfb777-a924-1049-d609-e66601d45b04.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.